package com.company.courseOne.homework3;

/**
 * В нашем банке можно, кроме дебетовых, получать еще и кредитные карты.
 * У таких карт есть допустимый лимит средств, который рассчитывается исходя из возраста клиента и его зарплаты.
 *
 * Правила расчета следующие:
 * Людям старше (или равно) 23 лет мы предоставляем лимит в размере 3 зарплат.
 * Людям младше 23 лет мы предоставляем лимит в размере 2 зарплат.
 * Если заработная плата клиента выше (или равно) 50 тысяч, мы увеличиваем лимит в 1.2 раза.
 * Если заработная плата выше (или равно) 80 тысяч, мы увеличиваем лимит в 1.5 раза.
 *
 * Наша задача: написать программу, которая показывает, какую сумму на кредитке может получить клиент.
 *
 * Вводные данные:
 * переменная age = 19 для обозначения возраста клиента,
 * salary = 58_000 для обозначения зарплаты клиента.
 *
 * Увеличения не могут быть применены одновременно.
 * Необходимо вывести максимальный лимит в консоль в формате: «Мы готовы выдать вам кредитную карту с лимитом *** рублей».
 */
@SuppressWarnings("ConstantConditions")
public class Task6 {
    public static void main(String[] args) {
        int age = 19;
        int salary = 58_000;
        float result;

        if (age >= 23) {
            result = salary * 3;
        } else {
            result = salary * 2;
        }

        if (salary >= 80_000) {
            result *= 1.5;
        } else if (salary >= 50_000) {
            result *= 1.2;
        }

        System.out.println("Мы готовы выдать вам кредитную карту с лимитом " + result + " рублей");

    }
}
